import { useState } from 'react';
import Checkbox from '../form/Checkbox';

export default function TermsAgreement({ agreements, setAgreements }) {
  // const [agreements, setAgreements] = useState({
  //   all: false,
  //   termsOfUse: false,
  //   personalInform: false,
  //   pushInform: false,
  // });

  // 전체 동의 핸들러
  const handleAllChange = () => {
    const newState = !agreements.all;
    setAgreements({
      all: newState,
      termsOfUse: newState,
      personalInform: newState,
      pushInform: newState,
    });
  };

  // 개별 동의 핸들러
  const handleIndividualChange = key => {
    setAgreements(prev => {
      const updatedState = { ...prev, [key]: !prev[key] };
      updatedState.all =
        updatedState.termsOfUse &&
        updatedState.personalInform &&
        updatedState.pushInform;
      return updatedState;
    });
  };

  return (
    <div className="py-6 ">
      <h1 className="text-2xl font-bold mb-4">약관 동의</h1>

      {/* 전체 동의 */}
      <div className="flex items-center mb-4">
        <Checkbox
          id="all"
          checked={agreements.all}
          onChange={handleAllChange}
          color="red-500"
          label="약관 전체동의"
        />
      </div>

      {/* 서비스 이용약관 */}
      <div className="border rounded-md p-4 mb-4">
        <div className="flex items-center mb-2">
          <Checkbox
            id="termsOfUse"
            checked={agreements.termsOfUse}
            onChange={() => handleIndividualChange('termsOfUse')}
            color="red-500"
            label="서비스 이용약관 (필독)"
          />
          {/* <input
            type="checkbox"
            id="termsOfUse"
            checked={agreements.termsOfUse}
            onChange={() => handleIndividualChange('termsOfUse')}
            className="w-5 h-5 text-red-500 border-gray-300 rounded focus:ring-red-500"
          />
          <label htmlFor="termsOfUse" className="ml-2 font-bold">
            서비스 이용약관 (필독)
          </label> */}
        </div>
        <div className="h-24 overflow-y-scroll border-t pt-2 text-sm text-gray-600">
          {/* <ul className="list-disc pl-6">
            <li>실명이 아니거나 타인의 명의를 이용하여 신청한 경우</li>
            <li>사이트가 제공하는 소정의 이용신청요건을 충족하지 못한 경우</li>
            <li>
              본 약관 제5조에 의하여 회원자격을 상실한 자로서, 3년이 경과되지
              아니한 경우
            </li>
          </ul> */}
          <p>
            제 1 조 (목적)
            <br />
            이 이용약관(이하 “본 약관”이라 합니다)은 &quot;광화문몰&quot;에서
            제공하는 인터넷 서비스를 이용함에 있어 회원과 &quot;광화문몰&quot;의
            권리 의무 및 책임사항 규정함을 목적으로 합니다.
            <br />
            제 2 조 (용어의 정의)
            <br />
            1) &quot;회원&quot;이란 본 이용약관에 동의하고
            &quot;광화문몰&quot;에 개인정보를 제공하여 회원 등록한자를 말합니다.
            <br />
            2) “비회원”이란 회원에 가입하지 않고 사이트가 제공하는 서비스를
            이용하는 자를 말합니다.
            <br />
            3) &quot;광화문몰&quot;이란 사이트를 운영하는 주체는 주식회사
            광화문몰을 말합니다.
            <br />
            4) “사이트”, “서비스”란 회사가 회원들에게 인터넷 관련 서비스를
            제공하기 위하여 컴퓨터 정보통신설비를 이용하여 구축한
            &quot;광화문몰&quot; 앱을 말합니다.
            <br />
            5) 본 약관에서 사용하는 용어 중 정하지 아니한 것은, 관계법령 및
            &quot;광화문몰&quot;이 정하는 바에 따르며, 그 외에는 일반 관례를
            따릅니다.
            <br />
            제 3 조 (약관의 명시와 개정)
            <br />
            1) 본 약관은 사이트 하단 이용약관 링크를 통해 언제든지 확인하실 수
            있습니다.
            <br />
            2) &quot;광화문몰&quot;은 합리적인 사유가 발생할 경우 관련 법령에
            위배되지 않는 범위에서 본 약관을 개정할 수 있습니다.
            <br />
            3) 개정된 약관은 사이트를 통해 공지함으로써 효력을 발휘합니다.
            공지는 사이트 첫 화면 공지사항에 적용일자 7일 전부터 적용일자까지
            공지합니다.
            <br />
            제 4 조 (회원가입 및 ID부여)
            <br />
            1) 사이트가 제시한 회원가입 절차에 따라, 본 약관에 동의한다는
            의사표시를 한 후 가입 양식에 정보를 기입함으로서 회원가입을
            신청합니다.
            <br />
            2) 회원가입의 성립 시기는 사이트 회원가입이 완료된 시점으로 합니다.
            <br />
            3) &quot;광화문몰&quot;은 회원에 대하여 약관에 정하는 바에 따라
            사이트 회원 ID를 부여합니다. 회원 ID는 원칙적으로 변경이 불가하며
            부득이한 사유로 인하여 변경 하고자 하는 경우에는 해당 ID를 해지하고
            재가입해야 합니다.
            <br />
            4) ID는 본인실명으로 발급하는 것을 원칙으로 합니다.
            <br />
            5) 회원은 등록사항에 변경이 있는 경우, 회원정보수정 페이지를 통하여
            변경사항을 정정하여 기재하여야 합니다.
            <br />
            6) &quot;광화문몰&quot;은 사이트에 회원 가입을 신청한 회원 중 다음
            각 호에 해당하는 회원은 회원등록을 허락하지 않습니다.
            <br />
            ① 등록내용에 허위, 기재누락, 오기가 있는 경우
            <br />
            ② 사이트의 안녕질서 또는 공서양속을 저해할 목적으로 신청한 경우
            <br />
            ③ 실명이 아니거나 타인의 명의를 이용하여 신청한 경우
            <br />
            ④ 기타, 사이트가 제공하는 소정의 이용신청요건을 충족하지 못한 경우
            <br />
            ⑤ 본 약관 제5조에 의하여 회원자격을 상실한 자로서, 3년이 경과되지
            아니한 경우 제 5 조 (회원 정보수정, 탈퇴 및 자격 상실 등)
            <br />
            1)회원 및 이용자는 개인정보관리화면을 통하여 언제든지 본인의
            개인정보를 열람하고 수정할 수 있습니다. 다만, 서비스 관리를 위해
            필요한 실명, 아이디 등은 수정이 불가능합니다.
            <br />
            2) 회원 및 이용자는 당사자가 가입신청 시 기재한 사항이 변경되었을
            경우, 온라인으로 로그인하여 개인정보를 수정합니다.
            <br />
            3) 제 2항의 변경사항을 변경하지 않아 발생한 불이익에 대하여 단체는
            책임지지 않습니다.
            <br />
            회원이 다음 각호의 사유에 해당하는 경우, &quot;광화문몰&quot;은
            회원자격을 제한 및 정지, 탈퇴시킬 수 있습니다.
            <br />
            ① 가입 신청시에 등록내용을 허위로 기록한 사실이 밝혀진 경우
            <br />
            ② 다른 회원들의 사이트 이용을 방해하거나, 각 서비스 운영원칙을
            따르지 않고 운영질서를 어지럽히는 경우 ③ 회원 및 이용자는 당사자가
            가입신청 시 기재한 사항이 변경되었을 경우, 온라인으로 로그인하여
            개인정보를 수정합니다.
            <br />
            ④ 제 2항의 변경사항을 변경하지 않아 발생한 불이익에 대하여 단체는
            책임지지 않습니다.
            <br />
            ⑤ 법령 위반 또는 외설적인 내용으로 미풍양속에 위배되거나, 공공질서에
            저해하는 행위를 하는 경우 ⑥ &quot;광화문몰&quot;의 합법적인 동의
            없이 영리를 추구할 목적으로 사이트를 이용하는 경우 ⑦
            &quot;광화문몰&quot;이 회원 자격을 제한·정지 시킨 후, 동일한 행위가
            2회 이상 반복되거나 30일 이내에 그 사유가 시정되지 아니하는 경우 ⑧
            타인의 ID와 비밀번호를 무단으로 도용한 경우
            <br />
            ⑨ 사이트 내에서 컴퓨터 바이러스 프로그램을 유포하는 경우
            <br />
            ⑩ &quot;광화문몰&quot; 및 회원, 제3자의 지적재산권을 침해하는 경우
            <br />
            제 6 조 (회원의 개인정보보호)
            <br />
            1) &quot;광화문몰&quot;은 회원으로 가입하는 시점에서 이름, 생년월일,
            성별, 메일, 전화번호, 주소 등을 개인정보로 수집합니다.
            <br />
            2) &quot;광화문몰&quot;은 관련법령이 정하는 바에 따라서 회원
            등록정보를 포함한 회원의 개인정보를 보호하기 위하여 노력합니다. 단,
            &quot;광화문몰&quot;의 공식 사이트 이외의 링크된 사이트에서는
            &quot;광화문몰&quot;의 개인정보취급방침이 적용되지 않습니다. 또한
            회원은 비밀번호 등이 타인에게 노출되지 않도록 철저히 관리해야 하며
            &quot;광화문몰&quot;은 회원의 귀책사유로 인해 노출된 정보에 대해서
            책임을 지지 않습니다.
            <br />
            3) 회원의 개인정보보호에 관해서는 관련법령 및 &quot;광화문몰&quot;이
            정하는 “개인정보취급방침”에 정한 바에 의합니다.
            <br />
            4) &quot;광화문몰&quot;은 다음과 같은 경우 법이 허용하는 범위 내에서
            회원의 개인정보를 제3자에게 제공할 수 있습니다.
            <br />
            ① 수사기관이나 기타 정부기관으로부터 정보제공을 요청받은 경우
            <br />
            ② 회원의 법령 또는 약관의 위반을 포함하여 부정행위 확인 등의
            정보보호 업무를 위해 필요한 경우 ③ 기타 법률에 의해 요구되는 경우
            <br />
            제 7 조 (회원에 대한 통지)
            <br />
            1) &quot;광화문몰&quot;이 회원에 대한 통지를 하는 경우, 회원이
            <br />
            &quot;광화문몰&quot;에 제출한 메일주소, 핸드폰번호(SMS문자)로 할 수
            있습니다.
            <br />
            2) &quot;광화문몰&quot;은 불특정다수 회원에 대한 통지의 경우
            1주일이상 사이트 해당 게시판에 게시함으로서 개별 통지에 갈음할 수
            있습니다.
            <br />
            제 8 조 (서비스의 내용)
            <br />
            &quot;광화문몰&quot;은 사이트를 통해 다음과 같은 서비스를
            제공합니다.
            <br />
            1) 뉴스 서비스
            <br />
            2) 미디어 서비스
            <br />
            3) 쇼핑 서비스 (쇼핑 중개 서비스)
            <br />
            4) 행사 서비스 (행사 중개 서비스)
            <br />
            5) 교육 서비스
            <br />
            6) 기타 &quot;광화문몰&quot;이 추후에 다른 단체와 제휴하여 제공하는
            일체의 서비스
            <br />
            제 9 조 (서비스 이용계약의 성립)
            <br />
            &quot;광화문몰&quot;이 사이트에 제시한 회원가입 절차에 따라, 본
            약관에 동의하고, 회원정보 입력 후 가입하기 버튼을 누르면,
            &quot;광화문몰&quot; 서비스 및 기타 사이트에서 제공하는 모든 서비스
            이용에 동의하는 것으로 인정합니다.
            <br />
            제 10 조 (서비스 이용시간)
            <br />
            1) &quot;광화문몰&quot;의 업무상 혹은 기술상 특별한 이유가 없는 한
            &quot;광화문몰&quot;에서 제공하는 서비스는 365일, 1일 24시간
            지속적으로 이용할 수 있습니다.
            <br />
            2) &quot;광화문몰&quot;은 시스템 정기점검, 증설 및 교체를 위해
            &quot;광화문몰&quot;이 정한 날이나 시간에 서비스를 일시 중단할 수
            있으며, 예정되어 있는 작업으로 인한 서비스 일시 중단은 사이트를 통해
            사전에 공지합니다.
            <br />
            3) &quot;광화문몰&quot;은 긴급한 시스템 점검, 증설 및 교체, 설비의
            장애,, 서비스 이용의 폭주, 국가비상사태, 정전 등 부득이한 사유가
            발생한 경우 사전 예고 없이 일시적으로 서비스의 전부 또는 일부를
            중단할 수 있습니다.
            <br />
            제 11 조 (서비스 이용 제한)
            <br />
            &quot;광화문몰&quot;은 회원이 서비스 이용내용에 있어서 본 약관 제
            5조를 위반하거나, 다음 각 호에 해당하는 경우 서비스 이용, 제한 ,
            초기화, 이용계약 해지 및 기타 해당 조치를 할 수 있습니다.
            <br />
            ① 공공질서 및 미풍양속에 위반되는 저속, 음란한 내용 또는 타인의
            명예나 프라이버시를 침해할 수 있는 내용의 정보, 문장, 도형, 음향,
            동영상을 전송, 게시, 메일 또는 기타의 방법으로 타인에게 유포하는
            행위 ② 다른 이용자를 희롱 또는 위협하거나, 특정 이용자에게
            지속적으로 고통 또는 불편을 주는 행위 ③ 정보통신윤리위원회등 관련
            공공기관의 시정 요구가 있는 경우
            <br />
            ④ 3개월 이상 사이트에 로그인 한 적이 없는 경우
            <br />
            ⑤ 약관을 포함하여 회사가 정한 제반 규정을 위반하거나 범죄와
            결부된다고 객관적으로 판단되는 등 제반 법령을 위반하는 행위 제 12 조
            (서비스의 중단)
            <br />
            1) &quot;광화문몰&quot;은 컴퓨터 등 정보통신설비의 보수점검, 교체 및
            고장, 통신의 두절 등의 사유가 발생한 경우에는 서비스의 제공을
            일시적으로 중단할 수 있습니다.
            <br />
            2) 새로운 서비스로의 교체등 기타 &quot;광화문몰&quot;이 적절하다고
            판단하는 합리적인 사유의 경우 현재 제공되는 서비스를 완전히 중단할
            수 있습니다.
            <br />
            3) 서비스 중단의 경우에 &quot;광화문몰&quot;은 제7조에 정한 방법으로
            회원에게 사전 통지합니다. 단, &quot;광화문몰&quot;이 통제할 수 없는
            사유로 인한 서비스의 중단(시스템 관리자의 고의, 과실이 없는 디스크
            장애, 시스템다운 등)으로 인하여 사전 통지가 불가능한 경우에는
            그러하지 아니합니다.
            <br />
            제 13 조 (서비스의 쇼핑 중개 및 약관 적용)
            <br />
            1) &quot;광화문몰&quot;은 사이트에서 제공되거나 연결된 서비스 및
            상품 직접 링크를 통해서 사이버쇼핑몰로 쇼핑을 중개할 수 있습니다.
            <br />
            2) 쇼핑 링크 이용약관은 페이지 하단을 통해 공지하며 공정거래위원회
            표준약관을 사용합니다.
            <br />
            3) 쇼핑 링크 중 “광화문 온” 외의 쇼핑몰로 이동하는 경우의 이용약관은
            해당 쇼핑몰의 이용약관을 사용합니다.
            <br />
            제 14 조 (&quot;광화문몰&quot;의 의무)
            <br />
            1) &quot;광화문몰&quot;은 법령과 이 약관이 금지하거나 미풍양속에
            반하는 행위를 하지 않으며 이 약관이 정하는 바에 따라 지속적이고,
            안정적으로 서비스를 제공하는 데 최선을 다하여야 합니다.
            <br />
            2) &quot;광화문몰&quot;은 계속적이고 안정적인 서비스의 제공을 위하여
            설비에 장애가 생기거나 멸실된 때에는 부득이한 사유가 없는 한 지체
            없이 이를 수리 또는 복구합니다.
            <br />
            3) &quot;광화문몰&quot;은 회원이 안전하게 사이트를 이용할 수 있도록
            회원의 개인정보(신용정보 포함)보호를 위한 보안 시스템을 구축합니다.
            <br />
            제 15 조 (회원의 의무)
            <br />
            1) 회원은 회원가입 신청 또는 회원정보 변경시 모든 사항을 사실에
            근거하여 본인의 진정한 정보로 작성하여야 하며, 허위 또는 타인의
            정보를 등록할 경우 이와 관련된 모든 권리를 주장할 수 없습니다.
            <br />
            2) 회원은 약관에서 규정하는 사항과 기타 &quot;광화문몰&quot;이 정한
            제반 규정, 공지사항등 &quot;광화문몰&quot;이 공지하는 사항 및 관계
            법령을 준수하여야 하며, 기타 &quot;광화문몰&quot;의 업무에 방해가
            되는 행위, &quot;광화문몰&quot;의 명예를 손상시키는 행위, 타인에게
            피해를 주는 행위를 해서는 안 됩니다.
            <br />
            3) 회원은 주소, 연락처, 전자우편 주소 등 이용계약 사항이 변경된
            경우에 회원정보수정을 거쳐 변경된 내용을 알려야 합니다.
            <br />
            4) 회원은 &quot;광화문몰&quot;의 사전 승낙 없이 서비스를 이용하여
            영업활동을 할 수 없으며, 그 영업 활동의 결과에 대해
            &quot;광화문몰&quot;은 책임을 지지 않습니다. 또한 회원은 이와 같은
            영업 활동으로 &quot;광화문몰&quot;이 손해를 입은 경우, 회원은
            &quot;광화문몰&quot;에 대해 손해배상의무를 지며,
            &quot;광화문몰&quot;은 해당 회원에 대해 서비스 이용제한 및 적법한
            절차를 거쳐 손해배상 등을 청구 할 수 있습니다.
            <br />
            5) 회원은 &quot;광화문몰&quot;의 명시적 동의가 없는 한 서비스의
            이용권한, 기타 이용계약상의 지위를 타인에게 양도, 증여할 수 없으며,
            이를 담보로 제공할 수 없습니다.
            <br />
            6) 회원은 &quot;광화문몰&quot; 및 제 3자의 지적 재산권을 포함한 제반
            권리를 침해하거나 제 5조 각 호에 해당하는 행위를 해서는 안 됩니다.
            <br />
            제 16 조 (광고게재 및 광고주와의 거래)
            <br />
            1) &quot;광화문몰&quot;이 회원에게 서비스를 제공할 수 있는 서비스
            투자기반의 일부는 광고게재를 통한 수익으로부터 나옵니다. 회원은
            서비스 이용시 노출되는 광고게재에 대해 동의합니다.
            <br />
            2) &quot;광화문몰&quot;은 서비스 상에 게재되어 있거나 서비스를 통한
            광고주의 판촉활동에 회원이 참여하거나 교신 또는 거래를 함으로써
            발생하는 손실과 손해에 대해 책임을 지지 않습니다.
            <br />
            제 17 조 (게시물)
            <br />
            1) 게시물이라 함은 회원이 서비스를 이용하면서 게시판 글, 댓글, 사진,
            동영상, 각종 파일과 링크 등을 말합니다.
            <br />
            2) 회원이 서비스에 등록하는 게시물 등으로 인하여 본인 또는 타인에게
            손해나 기타 문제가 발생하는 경우 회원은 이에 대한 책임을 지게 되며,
            &quot;광화문몰&quot;은 이에 대하여 책임을 지지 않습니다.
            <br />
            3) &quot;광화문몰&quot;은 다음 각 호에 해당하는 게시물 등을 회원의
            사전 동의 없이 임시게시 중단, 수정, 삭제, 이동 또는 등록거부 등의
            관련 조치를 취할 수 있습니다.
            <br />
            ① 타인에 대한 인신공격성 발언, 저속한 표현 등을 사용한 경우
            <br />
            ② 이단시비와 관련된 내용을 유포, 링크하는 것으로 인해
            &quot;광화문몰&quot; 인터넷 서비스의 본연의 목적과 취지에 위배되는
            경우 ③ 외설적인 내용으로 미풍양속에 위배되거나, 공공질서에 저해하는
            내용을 유포, 링크하는 경우 ④ 영리를 목적으로 하는 광고일 경우
            <br />
            ⑤ 범죄와 결부된다고 객관적으로 인정되는 내용일 경우
            <br />
            ⑥ &quot;광화문몰&quot;을 포함한 다른 회원 또는 제 3자의 저작권 등
            기타 권리를 침해하는 내용인 경우 ⑦ &quot;광화문몰&quot;에서 규정한
            게시물 원칙에 어긋나거나, 게시판 성격에 부합하지 않는 경우 ⑧ 기타
            관계법령에 위반되는 경우
            <br />
            제 18 조 (저작권의 귀속 및 이용제한)
            <br />
            1) &quot;광화문몰&quot;이 작성한 저작물에 대한 저작권 및 기타
            지적재산권은 &quot;광화문몰&quot;에 귀속합니다.
            <br />
            회원은 사이트를 이용함으로써 얻은 정보를 &quot;광화문몰&quot;의 사전
            승낙 없이 복제, 송신, 출판, 배포, 방송 기타 방법에 의하여
            영리목적으로 이용하거나 제3자에게 이용하게 하여서는 안 됩니다.
            <br />
            2) 게시물(회원이 사이트에 등록한 글, 댓글, 사진, 동영상, 각종 파일
            등)에 대한 권리와 책임은 회원에게 있습니다. &quot;광화문몰&quot;은
            회원의 동의 없이 게시물을 영리적 목적으로 사용하지 않습니다.
            <br />
            제 19 조 (분쟁해결)
            <br />
            1) &quot;광화문몰&quot;은 회원이 제기하는 정당한 의견이나 불만을
            반영하고 그 피해를 적극적으로 처리합니다.
            <br />
            2) &quot;광화문몰&quot;은 회원으로부터 제출되는 불만사항 및 의견은
            우선적으로 그 사항을 처리합니다. 다만, 신속한 처리가 곤란한 경우에는
            회원에게 그 사유와 처리일정을 즉시 통보합니다.
            <br />
            제 20 조(면책조항)
            <br />
            1) 천재지변 등 불가항력에 의한 서비스 중단 및 회원이 올린 데이타의
            유실 혹은 손상시 &quot;광화문몰&quot;은 책임이 면제됩니다.
            <br />
            2) &quot;광화문몰&quot;은 회원이 게재한 정보의 사실여부, 정확도 등
            내용에 대해서는 책임이 면제됩니다.
            <br />
            3) 서비스 이용과 관련하여 회원에게 발생한 손해 중 회원의 고의,
            과실에 의한 손해에 대하여 책임이 면제 됩니다.
            <br />
            4) &quot;광화문몰&quot;은 회원이 서비스를 이용하여 기대하는 수익을
            상실한 것에 대하여 책임을 지지 않으며 그밖에 서비스를 통하여 얻은
            자료로 인한 손해에 관하여 책임이 면제됩니다.
            <br />
            제 21 조(재판권 및 준거법)
            <br />
            1) &quot;광화문몰&quot;과 회원간에 발생한 전자거래 분쟁에 관한
            소송은 &quot;광화문몰&quot;운영사 소재지 관할법원에 제기합니다.
            <br />
            2) &quot;광화문몰&quot;과 회원간에 제기된 전자거래 소송에는 한국법을
            적용합니다.
            <br />
            제21조(연결“몰”과 피 연결“몰” 간의 관계)
            <br />
            1) 상위 “몰”과 하위 “몰”이 하이퍼링크(예: 하이퍼링크의 대상에는
            문자, 그림 및 동화상 등이 포함됨)방식 등으로 연결된 경우, 전자를
            연결 “몰”(웹 사이트)이라고 하고 후자를 피 연결 “몰”(웹 사이트)이라고
            합니다.
            <br />
            2) 연결“몰”은 피 연결“몰”이 독자적으로 제공하는 재화 등에 의하여
            이용자와 행하는 거래에 대해서 보증 책임을 지지 않는다는 뜻을
            연결“몰”의 초기화면 또는 연결되는 시점의 팝업화면으로 명시한
            경우에는 그 거래에 대한 보증 책임을 지지 않습니다.
            <br />
            제22조(저작권의 귀속 및 이용제한)
            <br />
            1) “몰“이 작성한 저작물에 대한 저작권 기타 지적재산권은 ”몰“에
            귀속합니다.
            <br />
            2) 이용자는 “몰”을 이용함으로써 얻은 정보 중 “몰”에게 지적재산권이
            귀속된 정보를 “몰”의 사전 승낙 없이 복제, 송신, 출판, 배포, 방송
            기타 방법에 의하여 영리목적으로 이용하거나 제3자에게 이용하게
            하여서는 안 됩니다.
            <br />
            3) “몰”은 약정에 따라 이용자에게 귀속된 저작권을 사용하는 경우 당해
            이용자에게 통보하여야 합니다.
            <br />
            - 부칙 -<br />
            본 이용약관이 법령, 정책 또는 &quot;광화문몰&quot;의 합리적인 이유에
            의해 내용의 추가, 삭제 및 수정이 있을 시에는 변경사항의 시행일의 7일
            전부터 &quot;광화문몰&quot; 사이트의 공지사항을 통하여 고지할 것
            입니다.
            <br />
            1. 본 약관은 2021년 6월 23일부터 적용됩니다.
          </p>
        </div>
      </div>
      {/* TODO 광화문몰 약관내용을 회원가입페이지와 운영페이지 일원화, 개인정보 처리위탁의 위탁업무 내용을 정리 - 국민레저측과 협의 */}
      {/* 개인정보취급방침 */}
      <div className="border rounded-md p-4 mb-4">
        <div className="flex items-center mb-2">
          <Checkbox
            id="personalInform"
            checked={agreements.personalInform}
            onChange={() => handleIndividualChange('personalInform')}
            color="red-500"
            label="개인정보취급방침 (필독)"
          />
          {/* <input
            type="checkbox"
            id="personalInform"
            checked={agreements.personalInform}
            onChange={() => handleIndividualChange('personalInform')}
            className="w-5 h-5 text-red-500 border-gray-300 rounded focus:ring-red-500"
          />
          <label htmlFor="personalInform" className="ml-2 font-bold">
            개인정보취급방침 (필독)
          </label> */}
        </div>
        <div className="h-24 overflow-y-scroll border-t pt-2 text-sm text-gray-600">
          <p>
            광화문몰은 회원 여러분의 개인정보 보호를 중요하게 생각합니다. 회원
            여러분이 광화문몰에서 제공하는 서비스를 이용함에 회원의 개인정보가
            보호받을 수 있도록 아래의 개인정보 취급방침을 준수합니다.
            <br />
            광화문몰의 개인보호 취급방침을 읽으시고 서비스를 이용하는 동안
            회원의 개인 정보가 어떻게 보호되는지 이해하시고 참고해주시기
            바랍니다. 또한 개인정보 취급방침은 정부의 법률 및 지침 변경이나
            광화문몰 내부의 방침에 따라 내용이 변경될 수 있습니다. 본 내용에
            대해선 회원 여러분은 언제든지 사이트 하단의 개인정보 취급방침 소개
            페이지를 통하여 열람할 수 있습니다.
            <br />
            1. 개인정보 수집에 대한 동의 2. 개인정보의 수집 및 이용목적 3.
            수집하는 개인정보 항목 및 수집방법 4. 개인정보의 보유 및 이용기간 5.
            개인정보의 파기절차 및 방법 6. 개인정보의 공유 및 제공 7. 개인정보
            취급위탁 업무 내용 8. 비회원 고객 개인정보 보호 9. 개인정보
            자동수집장치의 설치/운영 및 거부 10. 개인정보보호를 위한
            기술적/제도적 관리 11. 이용자 및 법정대리인의 권리와 그 행사방법 12.
            개인정보보호문의 및 개인정보관리책임 13. 광화문몰 고객센터 안내 -
            부칙 -<br />
            1. 개인정보 수집에 대한 동의 광화문몰은 회원의 개인정보 수집에
            대하여 동의를 받고 있으며, 사이트 회원가입 절차 중 약관동의(이용약관
            및 개인정보취급방침) 절차를 마련해 두고 있습니다.
            <br />
            2. 개인정보의 수집 및 이용목적 <br />
            1) 회원관리
            <br />
            대한민국을 세계강국으로 발전시키며 국민 행복에 기여함을 목적으로
            최선을 다할 것 입니다.
            <br />
            이에 회원관리, 개인식별, 이용약관 위반 회원에 대한 이용제한 조치
            등을 위한 목적으로 수집된 개인정보가 이용됩니다. 만14세 미만 아동
            개인정보 수집 시 법정 대리인 동의여부 확인, 분쟁 조정을 위한
            기록보존, 불만처리 등을 위해서 사용됩니다.
            <br />
            2) 서비스 제공 및 정산
            <br />
            맞춤형 컨텐츠, 맞춤형 서비스 제공과 메일링, 티켓팅, 정산, 쇼핑몰
            물품 배송, 배송진행상황의 통보, 신상품이나 기획전 정보 안내 등
            서비스 계약사항을 진행하기 위해 수집됩니다.
            <br />
            3) 서비스 운영 및 개발에 활용 사이트 운영 통계 관련 정보, 회원들의
            접속 빈도등 서비스 활성화 및 개발을 위해 통계 자료들이 수집됩니다.
            <br />
            3. 수집하는 개인정보 항목 및 수집방법 광화문몰은 이용자들이
            회원서비스를 이용하기 위해 회원으로 가입할 때 서비스 제공을 위한
            필수적인 정보들을 사이트를 통해 입력 받고 있습니다.
            <br />
            1) 수집하는 개인정보 항목
            <br />
            - 회원가입
            <br />
            필수항목 : 아이디, 비밀번호, 성명, 생년월일, 성별, 휴대폰번호, 주소
            가 수집됩니다.
            <br />
            만 14세미만 어린이는 회원가입시 부모님(법정대리인)의 동의를 받고
            있으며 아이디, 비밀번호, 성명, 생년월일, 성별, 메일주소가 수집되며
            휴대폰번호는 선택적으로 받고 있습니다.
            <br />
            - 추가정보입력
            <br />
            선택항목으로 종교, 교회 이름, 직분, 앱 추천인 이름, 앱 추천인 연락처
            - 유료 서비스 이용시 결제 정보 신용카드 :
            카드번호,유효기간,카드사명,카드명의자 주민번호앞자리 이체관련 :
            계좌번호,은행명,예금주명,예금주 주민번호 앞자리 휴대폰 소액결제 :
            휴대폰번호, 통신사, 가입자 생년월일 - 서비스 이용시 발생하는 항목 IP
            Address, 쿠키, 방문 일시, 서비스 이용 기록, 불량 이용 기록, 기기정보
            - 고객문의, 맞춤 서비스 등 부가 서비스와 이벤트 응모시 수집되는 항목
            메일주소, 휴대폰번호, 상품 배송을 위한 주소, 모바일 문의 처리를 위한
            스마트폰 OS버전 정보 등 2) 개인정보 수집방법
            <br />
            - 회원가입시 앱 입력 양식을 통해 - 고객문의, 제휴문의, 입점문의,
            이벤트 시 입력받는 정보는 입력 양식 또는 문의 메일등을 통해 4.
            개인정보의 보유 및 이용기간 개인정보는 제공받은 목적이 달성되면
            파기합니다. 단 아래와 같은 이유를 위해 명시한 기간 동안 보존합니다.
            <br />
            1) 회사 방침에 의한 정보보유 사유 - 광화문몰 사이트 목적에 맞지 않는
            가입 및 이용에 대한 기록 보존 항목 : 아이디, 이름, 휴대폰번호,
            메일주소, IP주소, 쿠키, 기기정보 보존 이유 : 부정 가입 및 이용 방지
            보존 기간 : 3년
            <br />
            2) 관련 법령에 의한 정보보유 사유 - 계약 또는 청약철회 등에 관한
            기록 보존 이유 : 전자상거래 등에서의 소비자보호에 관한 법률 보존
            기간 : 5년
            <br />
            - 대금결제 및 재화 등의 공급에 관한 기록 보존 이유 : 전자상거래
            등에서의 소비자보호에 관한 법률 보존 기간 : 5년
            <br />
            - 소비자의 불만 또는 분쟁처리에 관한 기록 보존 이유 : 전자상거래
            등에서의 소비자보호에 관한 법률 보존 기간 : 3년
            <br />
            - 웹사이트 방문기록
            <br />
            보존 이유 : 통신비밀보호법
            <br />
            보존 기간 : 3개월
            <br />
            5. 개인정보의 파기절차 및 방법 개인정보를 제공받은 목적이 달성된
            경우에 수집된 개인의 정보는 파기됩니다.
            <br />
            1) 파기절차
            <br />
            - 회원가입 및 서비스 등을 위해 입력한 정보는 이용목적이 달성된
            후에는 파기됩니다.
            <br />
            - 단, 회사 방침 및 관련 법령에 의해 정보보유 사유에 해당 하는
            개인정보의 경우 명시한 기간이후에 파기됩니다.
            <br />
            2) 파기방법
            <br />
            - 종이에 출력된 개인정보는 문서세단기로 파쇄합니다.
            <br />
            - 전자적 형태로 저장된 개인정보는 재생할 수 없는 방법에 의해
            하드디스크에서 완전히 삭제되며 어떠한 용도로도 열람 또는 이용할 수
            없도록 처리됩니다.
            <br />
            6. 개인정보의 공유 및 제공 광화문몰은 회원의 동의가 있거나 법률의
            규정에 의한 경우를 제외하고는 어떠한 경우에도 ‘2. 개인정보의 수집 및
            이용목적’에서 고지한 범위에서 넘어 회원의 개인정보를 이용하거나 타인
            또는 타기업, 기관에게 제공하지 않습니다. 다만, 아래의 경우에는
            예외로 합니다.
            <br />
            1) 서비스 이용을 위해 회원이 동의한 경우 - 회원이 서비스 이용을 위해
            개인정보 공유 및 제공에 동의한 모든 업체 제공받는자: 회원이 서비스
            이용을 위해 개인정보 공유 및 제공에 동의한 모든 업체 제공목적: 물품
            배송, 고객상담용, 결제 및 신청 정보 , 이용정보 제공하는
            개인정보항목: 이름, 전화번호, 주소 및 주문 정보 개인정보를 제공받는
            자의 개인정보 보유 및 이용기간: 서비스 제공 기간 동안 정보보유 후
            파기합니다. 단 관계 법령의 규정에 의하여 보존할 필요가 있는 경우
            해당 기간 만큼 보관 2) 법령에 정해진 규정에 의거하거나, 수사상의
            목적으로 관련 기관의 요구가 있을 경우 7. 개인정보 취급위탁 업무 내용
            개인정보를 제공받는 자(제 3자)는 아래와 같은 목적을 위해 개인정보를
            활용합니다. 이용자가 제공한 모든 정보는 다음의 목적으로 사용되며,
            이용 목적이 변경될 때에는 별도의 동의를 받는 등 필요한 조치를 이행할
            예정입니다.
            <br />
            회원제 서비스 제공
            <br />
            회원 납부 서비스 제공
            <br />
            광고를 위한 서비스 제공
            <br />
            고객서비스 제공
            <br />
            영리 목적의 광고성 정보를 제공 수탁자: 해피나눔 - (주)트라패스
            위탁사용 및 목적: 회비납부 서비스 이용에 따른
            결제정보확인(결제번호,생년월일 등) 보유 및 이용기간: 본인확인
            기관으로 이미 보유하고 있는 개인정보이기 때문에 별도로 저장하지 않음
            수탁자: 효성F&S
            <br />
            위탁사용 및 목적: 신용카드 결제승인, 자동이체, 휴대폰 결제
            서비스제공 보유 및 이용기간: 회원 탈퇴 및 위탁계약 만료시 까지
            수탁자: (주)피플링크
            <br />
            위탁사용 및 목적: 이용자 정보 확인 및 수정 보유 및 이용기간:
            고객상담을 위한 용도로 별도로 저장하지 않음 수탁자: 더피엔엘
            <br />
            위탁사용 및 목적: 광고를 위한 서비스제공 보유 및 이용기간: 회원 탈퇴
            및 위탁계약 만료시 까지 수탁자: 자유일보
            <br />
            위탁사용 및 목적: 뉴스 및 미디어 컨텐츠 서비스제공 보유 및 이용기간:
            회원 탈퇴 및 위탁계약 만료시 까지 수탁자: 퓨리턴컴퍼니
            <br />
            위탁사용 및 목적: 골센타 운영을 위한 서비스 제공 보유 및 이용기간:
            회원 탈퇴 및 위탁계약 만료시 까지 수탁자: 대한민국바로세우기
            본부(대국본), 사랑제일교회, 자유일보, 더피엔엘 위탁사용 및 목적:
            행사/집회 콘텐츠 서비스 제공, 전자적 전송매체(SMS/MMS/이메일 등)을
            통해 회원들에게 행사/집회 및 기타 유용한 광고 수신 보유 및 이용기간:
            회원 탈퇴 및 위탁계약 만료시 까지 8. 비회원 고객 개인정보 보호
            광화문몰이 운영하는 광화문몰몰은 비회원 고객 또한 물품 및 서비스
            상품의 구매를 할 수 있습니다. 비회원 주문의 경우 대금 결제와 상품
            배송에 반드시 필요한 개인정보 만을 고객에게 요청하고 있습니다.
            비회원 고객께서 입력하신 지불인 정보 및 수령인 정보는 대금 결제 및
            상품 배송에 관련한 용도 외에는 다른 어떠한 용도로도 사용하지
            않습니다.
            <br />
            9. 개인정보 자동수집장치의 설치/운영 및 거부 광화문몰은 회원들에게
            적합하고 보다 유용한 서비스를 제공하기 위해서, 회원의 정보를
            저장하고 수시로 불러오는 쿠키(Cookie)를 사용합니다.
            <br />
            쿠키(Cookie)란? 사이트에 접속시 자동으로 서버가 회원의 컴퓨터
            브라우저에게 보내는 소량의 텍스트 파일로서 회원들의 이용기기에
            저장됩니다.
            <br />
            1) 쿠키 사용 목적
            <br />
            회원들이 방문한 광화문몰의 각 서비스와 웹 사이트들에 대한 방문 및
            이용형태, 보안접속 여부, 접속빈도, 방문횟수, 이용자 규모 등을
            파악하여 이용자에게 최적화된 맞춤형 정보를 제공하기 위해 사용합니다.
            <br />
            2) 쿠키 수집을 거부하는 방법 회원들은 쿠키 설치에 대한 선택권을
            가지고 있습니다. 따라서 회원들은 웹 브라우저에서 옵션을 설정함으로써
            모든 쿠키를 허용하거나, 쿠키가 저장될 때마다 확인을 거치거나, 모든
            쿠키의 저장을 거부할 수도 있습니다. 다만 쿠키 설치를 거부할 경우 웹
            사용이 불편해지며 로그인이 필요한 일부 서비스 이용에 어려움이 있을
            수 있습니다.
            <br />
            설정 방법의 예<br />
            - Internet Explorer : 웹 브라우저 상단의 도구 메뉴 &gt; 인터넷 옵션
            &gt; 개인정보 &gt; 설정 - Chrome : 웹 브라우저 우측의 설정 메뉴 &gt;
            화면 하단의 고급 설정 표시 &gt; 개인정보의 콘텐츠 설정 버튼 &gt;
            쿠키 10. 개인정보보호를 위한 기술적/제도적 관리 광화문몰은 회원들의
            개인정보를 취급함에 있어 개인정보가 분실, 도난, 누출, 변조 또는
            훼손되지 않도록 안전성 확보를 위하여 다음과 같은 기술적 대책을
            강구하고 있습니다.
            <br />
            - 광화문몰은 개인정보 및 인증정보를 송수신할때는 웹서버에 SSL(Secure
            Socket Layer) 인증서를 설치하여 정보를 보고 하고 있습니다.
            <br />
            - 불법적인 해킹방지를 위해 자체 첨단 방화벽을 설치하여 운영하고
            있으며 접속 로그분석 및 실시간 바이러스 감시시스템이 운영중입니다.
            <br />
            - 개인정보 취급 직원을 최소한으로 제한하고 담당직원에 대한 수시
            교육을 통하여 본 정책의 준수를 강조하고 있으며, 문제가 발견될 경우
            바로 시정조치하고 있습니다.
            <br />
            11. 이용자 및 법정대리인의 권리와 그 행사방법 - 이용자 및
            법정대리인은 언제든지 자신의 개인정보를 조회하고 수정할 수 있습니다.
            <br />
            - 또한 개인정보 제공에 관한 동의철회/회원가입해지를 요청할 수
            있습니다.
            <br />
            - 만 14세 미만 어린이의 법정대리인은 어린이의 개인정보 열람, 정정,
            동의철회를 요청할 수 있습니다.
            <br />
            - 이용자가 개인정보의 오류에 대한 정정을 요청하신 경우에는 정정을
            완료하기 전까지 개인정보를 이용 또는 제공하지 않습니다. 혹시 잘못된
            개인정보를 제3 자에게 이미 제공한 경우에는 정정 처리결과를 제3자에게
            지체 없이 통지하여 정정이 되도록 하겠습니다.
            <br />
            권리행사방법
            <br />
            개인정보 조회/수정 : 사이트 내 ‘정보수정’ 클릭하여 조회 및 수정 가능
            회원탈퇴 : 사이트 내 ‘정보수정’ 클릭 후 회원탈퇴 가능 12.
            개인정보보호문의 및 개인정보관리책임자 광화문몰은 회원의 개인정보를
            보호하고 개인정보와 관련한 불만을 처리하기 위하여
            개인정보관리책임자를 두고 있습니다. 회원의 개인정보와 관련한
            문의사항이 있으시면 아래의 개인정보관리책임자 또는
            개인정보관리담당자에게 연락주시기 바랍니다.
            <br />
            개인정보 관리책임자
            <br />
            이 름 : 안성준
            <br />
            전 화 : 1522-8686
            <br />
            이메일 : ahnsj@thepnl.com 개인정보 관리담당자
            <br />
            이 름 : 이수영
            <br />
            전 화 : 1522-8686
            <br />
            이메일 : info@ghmon.com 광화문몰은 회원님의 문의사항 및 불만사항을
            신속히 처리하여 답변 드리도록 하겠습니다.
            <br />
            개인정보에 관한 상담이 필요하시면 정부에서 운영중인 아래의 기관에서
            도움을 받으실 수 있습니다.
            <br />
            - 개인정보 침해신고센터 (http://privacy.kisa.or.kr, 전화 국번없이
            118 ) - 대검찰청 사이버수사과 (http://www.spo.go.kr, 전화 국번없이
            1301 ) - 경찰청 사이버안전국 (http://www.ctrc.go.kr, 전화 국번없이
            182 ) 13. 광화문몰 고객센터 안내 광화문몰은 회원님들의 민원사항
            처리를 위해 고객센터를 운영하고 있으며 운영현황과 연락처는 다음과
            같습니다.
            <br />
            - 근무시간 : 평 일 09:00~18:00 (점심시간 12:00~13:00) 주말, 공휴일
            휴무 - 고객센터 : 1522-8686 - 부칙 -<br />
            본 개인정보취급방침이 법령. 정책 또는 보안기술의 변경에 따라 내용의
            추가. 삭제 및 수정이 있을 시에는 변경사항의 시행일의 7일 전부터
            광화문몰 사이트의 공지사항을 통하여 고지할 것 입니다.
            <br />
            ·개인정보취급방침 수정고지 : 2021년 6월 23일 ·개인정보취급방침
            시행일자 : 2021년 6월 23일
          </p>
        </div>
      </div>

      {/* 푸시 알림 서비스 수신 동의 */}
      <div className="border rounded-md p-4 mb-4">
        <div className="flex items-center">
          <Checkbox
            id="pushInform"
            checked={agreements.pushInform}
            onChange={() => handleIndividualChange('pushInform')}
            color="red-500"
            label="푸시(알림서비스) 수신 동의"
          />
          {/* <input
            type="checkbox"
            id="pushInform"
            checked={agreements.pushInform}
            onChange={() => handleIndividualChange('pushInform')}
            className="w-5 h-5 text-red-500 border-gray-300 rounded focus:ring-red-500"
          />
          <label htmlFor="pushInform" className="ml-2">
            푸시(알림서비스) 수신 동의
          </label> */}
        </div>
      </div>

      {/* 제출 버튼 */}
      {/* <button
        onClick={() => alert('동의가 완료되었습니다!')}
        disabled={!agreements.termsOfUse || !agreements.personalInform}
        className={`w-full py-3 rounded-md text-white ${
          agreements.termsOfUse && agreements.personalInform
            ? 'bg-red-500 hover:bg-red-600'
            : 'bg-gray-300 cursor-not-allowed'
        }`}
      >
        제출하기
      </button> */}
    </div>
  );
}
